# В фермерском хозяйстве в Карелии выращивают чернику. Она растет на круглой грядке, причем кусты высажены только по окружности.
# Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод – на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. Эта система состоит из управляющего модуля 
# и нескольких собирающих модулей. Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, 
# собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий модуль, 
# находясь перед некоторым кустом заданной во входном файле грядки.

import random

n=int(input('Введите количество кустов на грядке: '))

l=[]
for i in range(n):
    a=random.randint(1,11)
    l.append(a)

print(l)

sum=0
l2=[]

i=0
while i<n:
    if i!=n-1:
        sum=l[i]+l[i-1]+l[i+1]
        l2.append(sum)
        i+=1
    else:
        sum=l[i]+l[i-1]+l[0]
        l2.append(sum)
        i+=1

l2.sort()

print(l2[-1])