# Даны два неупорядоченных набора целых чисел (может быть, с повторениями). 
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во элементов второго множества. 
# Затем пользователь вводит сами элементы множеств.

n=int(input("Введите количество элеметов первого множества: "))

list1=[]
for i in range(0,n):
    a=int(input("Введите элемент первого множества: "))
    list1.append(a)

print(list1)


m=int(input("Введите количество элеметов второго множества: "))
list2=[]
for i in range(0,m):
    a=int(input("Введите элемент второго множества: "))
    list2.append(a)

print(list2)

a=set()

for i in range(0, len(list1)):
    a.add(list1[i])

b=set()

for i in range(0, len(list2)):
    b.add(list2[i])

c=a.intersection(b)

print(c)

l=list(c)

l.sort()

print(l)

print((f'В обоих наборах встречаются числа: {l}')) if len(c)!=0 else print("Повторяющихся чисел нет.")